In [1]:
# 1 Establish a connection between Python and the Sakila database.
!pip install mysql-connector-python
!pip install SQLAlchemy

Requirement already satisfied: mysql-connector-python in d:\anaconda\lib\site-packages (9.0.0)
Requirement already satisfied: SQLAlchemy in d:\anaconda\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in d:\anaconda\lib\site-packages (from SQLAlchemy) (2.0.1)

In [2]:
import pandas as pd

import mysql.connector
from sqlalchemy import create_engine

from getpass import getpass

In [10]:
password = getpass.getpass()

 ········

In [12]:
cnx = mysql.connector.connect(user = "root",
                             password = password,
                              host = "localhost",
                              database = "sakila"
                             )

In [14]:
cnx.is_connected()

True

In [16]:
cursor = cnx.cursor()
cursor

In [28]:
# 2 Write a Python function called rentals_month, that retrieves rental data for a given month and year
def rentals_month(engine, month, year):
    query = (f"""SELECT *
                FROM rental
                WHERE DATE_FORMAT(rental_date, '%m') = {month}
                AND DATE_FORMAT(rental_date, '%Y') = {year};""")
    cursor.execute(query)
    results = cursor.fetchall()
    df = pd.DataFrame(results)
    df.columns = ['rental_id', 'rental_date', 'inventory_id', 'customer_id', 'return_date', 'staff_id', 'last_update']
    return df
mydf = rentals_month(cnx, 7, 2005)
mydf

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53

In [58]:
# 3 
def rental_count_month(mydf , month, year):
    new_df = mydf[[ 'rental_id','customer_id']].groupby('customer_id').agg({'rental_id' : 'count'}).rename(columns={'rental_id': f'rentals_{month}_{year}'})
    return new_df
rental_count_month(mydf, '05', 2005)

             rentals_05_2005
customer_id
1                         12
2                         14
3                         13
4                          5
5                         16
...                      ...
595                       19
596                        6
597                        7
598                       16
599                        7

[599 rows x 1 columns]

In [94]:
#4 Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by
# each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.
def compare_rentals(df1 , df2):
    return df1.iloc[:, 0] - df2.iloc[:, 0]

df1 = rental_count_month(mydf, '05', 2005)
df2 = rental_count_month(mydf, '03', 2005)

compare_rentals(df1, df2)

customer_id
1      0
2      0
3      0
4      0
5      0
      ..
595    0
596    0
597    0
598    0
599    0
Length: 599, dtype: int64